# SaveAsOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SaveAsOptions Constructor
SaveAsOptions Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public SaveAsOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SaveAsOptions()
```

# See Also
SaveAsOptions Class
Autodesk.Revit.DB Namespace